# Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный.
# В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
# третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только
# в указанном порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.


from itertools import cycle
from time import sleep

class TrafficLight:
    def __init__(self):
        self.__color = (("Красный", 7),("Желтый", 2),("Зеленый", 9))


    def running(self):
        for color, sec in cycle(self.__color):
            print(f"Горит: {color}, еще гореть {sec} секунд(ы)")
            sleep(sec)

Checking_traffic_lights = TrafficLight()
Checking_traffic_lights.running()






