# Представлен список чисел. Необходимо вывести элементы исходного списка,
# значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

import random

original_list = random.sample(range(1, 100), 13)
print(original_list)
new_list = [el for numb, el in enumerate(original_list) if original_list[numb] > original_list[numb - 1]]

print(new_list)
